OdDAI.BaseType.isAggregationType
\details
Determines whether the nested data type is an aggregation data type.
\returns true if the nested data type is an aggregation data type; otherwise, the method returns false.

OdDAI.BaseType.isNamedType
\details
Determines whether the nested data type is a named data type.
\returns true if the nested data type is a named data type; otherwise, the method returns false.

OdDAI.BaseType.isSimpleType
\details
Determines whether the nested data type is a simple data type.
\returns true if the nested data type is a simple data type; otherwise, the method returns false.

OdDAI.BaseType.unset
\details
Clears the nested data type. The nested data type is unset after the method is executed.

OdDAI.BaseType.exists
\details
Checks whether the nested data type is specified within the base type instance.
\returns 1 if the nested data type is specified; otherwise (nested data type is unset), the method returns 0.

OdDAI.BaseType.#ctor
\details
Creates an instance of base data type definition with default parameters.
The nested data type for the created object is unset.

OdDAI.BaseType
\details
A base class that implements the storing and manipulating of data type definitions for attributes.